'''
카카오 삼성

- 삼성
dx 소프트웨어 개발




- 카카오
면접전형 60~70분 
20분정도는 코딩테스트 회고
특정문제에 대해서 풀이과정과 왜.
틀린문제가 있으면 어떻게 고칠 수 있을지..

힌트 있으니까 너무 긴장하지 말고

사전에 여러 방면으로 미리 생각해두는것이 좋음

나머지 시간에 프로젝트나 CS지식 관련 질문

프로젝트 없으니까 대외활동/ 석사 등
싸피에서 하는거 물어보고 관련 CS 질문

예시 
데이터베이스에 대해 설명
jpa query 왜 사용?
수 많은 데이터 검색 최적화
인덱싱.
인덱싱 관련 알고리즘

자바랑 스프리의 차이
스프링 부트의 창?
의존성 주의방법 서렴ㅇ
자바 8 11 차이
자바 메모리 동작원리

자바 php python 차이

이전 프로젝트에 들어있던 내용들이었음...

배웠던 부분들의 cs 기본을 잘 정리할 필요.
꼬리질문으로 이어짐
한번 더 생각해서 꼬리질문까지 염두에 두고 대답

가장 자신있는 부분으로 관련해서 대답하는것...


1차 1시간 2대1 면접관2
cs지식
자기소개서에 프로젝트 관련
2차 40분 인성면접 백프로
갈등경험 어떻게 해결
기술적 어려음 해결
어떻게 기술들 해결하는지 공부방식들

1. 본인이 카카오에 필요한 이유
본인의 강점
2. 특히 이 직무에 지원한 이유
관심도, 어떤일 하는지
3. 프로젝트 어려움 잇으면 어떠헥 해결 , 안맞는 팀원, 잘맞는 팀원.
팀원에게 이ㄹㅓㄴ거 고쳐달라는 피드백 받은적 이쓴지

작년 토론. 올해 기술면접?

프로젝트 관련 질문하면 
기술적인것도 중요하지만 어떤걸 배ㅜ었어? 인성적인 부분 등 중점적으로 물어본다.

2차면접 순수 인성면접 타이트하게 질문 압박감 느낌

카카오가 원하는것
cs지식 협업태도 등
이사람이 카카오랑 맞는 인재인가
어떤걸 열심히 공부했고 알고 있는가
카카오 스러움
기업 블로그 들어가보면 많이 나옴. 인재상.
실제 어떤 사람을 원하는지.
인재핏에 맞게 대답


비전공자 - 개발에 지원한 이유는 어떤 이유인지
어떻 게 잘 적응할 수 있는지
기초 cs 지식 차이가 있을텐데 어떻게 채울건지
마음에 들지 않느 팀원 이 있을때 어떻게 할것인가.

해외 적응 잘 지낸거 등
평소 개발할때 마음가짐
- 실력도 실력이지만 너가 개발자로서의 슬로건
- 어떤 서비스를 제공하고싶?
- 비전이나 사명감

프로젝트 관련해서 고민했던 부분
안됐던 부분들을 어떻게하면 개선할 수 있었는가 미리 생각

선형구조 비선형구조 
우선순위 큐의 구현
해시테이블
해시문제 
링크드 리스트 차이
dfs bfs 설명과 장단점
프로세스 메모리 영역
백엔드 개발시 

싸피에서 배운것에 대해 이야기해봐라
수학 왜 개발자
어떤 개발자
어떻게 공부

학부 석사 프로젝트 왜 했고 어떤걸 배웠고...
본인이 갖고있는 수학 강점이 어떻게 개발로 발현될수 있을지 
키워드로 각인 할 필요 있음

(중요)
비전공 개발자 어떻게 슬로건 어떻게 공부 싸피에서 배운거 공부
이전에 했던 경험 정리
협업에서 조화 이루는지

시간나면 카카오 블로그 인재상 등



삼성전자
특이사항 
창의 직무 인성 하루에 다 봄
창의 
문제 정의 해결방안
면접 30분 창의만

직무
1시간동안 문제 풀고
3개주제
택한 주제 소문제 3`4개 
30분 면접

예시)
직무 자료구조 알고리즘 관련
창의 답변하는게 아니라 왜 그런 생각 하게됐는지 부드럽게 진행
기출
창의 요즘 언택트 배달 라이더 운전법규 위반에 대해 어떠헥 생각?
교통 사고 라이더 안전 위협
라이더 공급 부족
관련 추가 자료

이를 해결하기 위해
ai 드론 플랫폼 자율주행 키워드 2개 활용하여 답변

객체지향 프로그래밍 수강했는데
객체지향과 아닌것의 차이?
학부 과목중 가장 인상깊었던 과목과 이유

자기소개서
사회 이슈 ai와 윤리
자율주행을 프로그램 
차 안에 한명 이상 절벽 앞에 5명
꺼끙면 떨어진다 어떻게?

직무 면접
cs를 많이 물어볼거라고 물어봤는데
pro 문제를 읽고 파악 한 뒤에 솔루션을 말해보라고 함
10분 -> 짧은시간

가스통의 최적화 문제?
k번 주유소 몇번의 주유소 들를수 있다
기름을 가득채움 2차원 n개 주유소

인성면접
크게 어렵진 않은데 약식으로 인성검사gsat
대기 한 후에 10`15분 후 인성검사
pc가 느려.. 시간을 부여
끝나고 인성면접
직무 면접 인성 끝나고 15분 후


인성면접 질문
공백기간에 어떻게 경제적으로 조달 버틸수 있는지
다른회사 지원?
사용할 수 있는 언어
좌절 실패
가장 자신있는 프로젝트?

자기소개
싸피에서 배운것
입과 이유
어떤걸 배웠냐
사업부 지원 이유
입사후 포부/ 비전
스트레스 어떻게 푸느냐
힘들었던 프로젝트
갈등 해결
다른사람들이 어떻게 본인을 생각?


직무면접
c언어 
프로세서 스레드
에자일 방법??

그외활동들에 대해 많이 물어볼것...
출판, 대학원, 연구실 등

창의는 준비 불가.
인성 직무 면접은 카카오랑 준비할것 같음
자기소개서 토대로 질문 많이 나올것임.
자기소개서에서 기출 문제들 뽑아볼것.
수학을 통해 좋은 서비스? 어떤 서비스? 우리회사에서 어떤 서비스?
적어도 자기소개서 작성한거에서 10개정도 문제 뽑아보고 답해볼것.

맡을일에 책임과 열정 사례? 이런식




'''